; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image1 - mode
	thermograph0 - mode
	thermograph2 - mode
	Star6 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star6)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Phenomenon9 thermograph2)
	(have_image Planet10 thermograph2)
	(have_image Planet11 image1)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 6
2. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 6
3. (turn_to satellite2 planet10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet10)
   goals met: 0 of 6
4. (take_image satellite2 planet10 instrument5 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 1 of 6
5. (turn_to satellite2 phenomenon9 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 6
6. (turn_to satellite1 groundstation0 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation0)
   goals met: 2 of 6
7. (take_image satellite2 phenomenon9 instrument5 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 3 of 6
8. (turn_to satellite2 planet11 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet11)
   goals met: 3 of 6
9. (take_image satellite2 planet11 instrument5 image1)
   added: (have_image planet11 image1)
   goals met: 4 of 6
10. (turn_to satellite2 planet7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet7)
   goals met: 4 of 6
11. (take_image satellite2 planet7 instrument5 image1)
   added: (have_image planet7 image1)
   goals met: 5 of 6
12. (turn_to satellite2 star8 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star8)
   goals met: 5 of 6
13. (take_image satellite2 star8 instrument5 image1)
   added: (have_image star8 image1)
   goals met: 6 of 6
